

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайла(ФайлКартинки, УникальныйИдентификатор)
	
	ДополнительныеПараметры = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	ДополнительныеПараметры.ИдентификаторФормы = УникальныйИдентификатор;
	
	Возврат РаботаСФайлами.ДанныеФайла(ФайлКартинки, ДополнительныеПараметры);
	
КонецФункции // ПолучитьДанныеФайла()
&НаКлиенте
Процедура ПросмотретьПрисоединенныйФайл()
	
	ОчиститьСообщения();
	ДанныеФайла = ПолучитьДанныеФайла(АдресИзображения, УникальныйИдентификатор);
	РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	
КонецПроцедуры // ПросмотретьПрисоединенныйФайл()
&НаКлиенте
Процедура ДобавитьИзображениеНаКлиенте()
	Оповещение  =  Новый ОписаниеОповещения("ОбработатьВыборФайла",   ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение,   ,   ,   Истина,   УникальныйИдентификатор);
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если Не Результат Тогда
		Возврат; 
	КонецЕсли;
	АдресИзображения = Адрес;
КонецПроцедуры
&НаКлиенте
Процедура АдресИзображенияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтоАдресВременногоХранилища(АдресИзображения) Тогда
		ПросмотретьПрисоединенныйФайл();
	Иначе
		ДобавитьИзображениеНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресИзображения) Тогда
		ТекущийОбъект.ОсновноеИзображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресИзображения));
	КонецЕсли;
	Абв = ТекущийОбъект.ОсновноеИзображение.Получить();
КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресИзображения = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ОсновноеИзображение");
	
КонецПроцедуры
