&НаКлиенте
Процедура am_ВернутьНаличнымиПосле(Команда)
	
	Объект.БезналичнаяОплата.Очистить();
	Объект.Предоплата.Очистить();
	
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

&НаСервере
Процедура am_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Если ТекПользователь <> Неопределено И ТекПользователь.am_ТехПоддержка Тогда
		Элементы.am_СтраницаТехПоддержка.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура am_РежимРазработчикаПриИзмененииПослеНаСервере()
	Если am_РежимРазработчика Тогда
		Элементы.Заказ.Вид = ВидПоляФормы.ПолеВвода;		
		Элементы.Контрагент.Вид = ВидПоляФормы.ПолеВвода;				
		Элементы.Договор.Вид = ВидПоляФормы.ПолеВвода;		
		Элементы.ЧекККМ.Вид = ВидПоляФормы.ПолеВвода;
	Иначе
		Элементы.Заказ.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Контрагент.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Договор.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.ЧекККМ.Вид = ВидПоляФормы.ПолеНадписи;
		
		Элементы.Заказ.Гиперссылка = Истина;
		Элементы.Контрагент.Гиперссылка = Истина;
		Элементы.Договор.Гиперссылка = Истина;
		Элементы.ЧекККМ.Гиперссылка = Истина;
	КонецЕсли;
	
	Элементы.НомерЧекаККМ.ТолькоПросмотр = НЕ am_РежимРазработчика;
	Элементы.Заказ.ТолькоПросмотр = НЕ am_РежимРазработчика;
	Элементы.Контрагент.ТолькоПросмотр = НЕ am_РежимРазработчика;
	Элементы.Договор.ТолькоПросмотр = НЕ am_РежимРазработчика;	
	Элементы.ЧекККМ.ТолькоПросмотр = НЕ am_РежимРазработчика;	
	Элементы.Номер.ТолькоПросмотр = НЕ am_РежимРазработчика;	
	Элементы.Дата.ТолькоПросмотр = НЕ am_РежимРазработчика;	
	Элементы.Организация.ТолькоПросмотр = НЕ am_РежимРазработчика;	
	Элементы.НомерЧекаККМ.ТолькоПросмотр = НЕ am_РежимРазработчика;	
	Элементы.Ответственный.ТолькоПросмотр = НЕ am_РежимРазработчика;
	Элементы.КассаККМ.ТолькоПросмотр = НЕ am_РежимРазработчика;
	Элементы.СтруктурнаяЕдиница.ТолькоПросмотр = НЕ am_РежимРазработчика;
	Элементы.Ячейка.ТолькоПросмотр = НЕ am_РежимРазработчика;
	Элементы.ОперацияСДенежнымиСредствами.Доступность = am_РежимРазработчика;	
	
	Элементы.ЧекККМ.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
КонецПроцедуры

&НаКлиенте
Процедура am_РежимРазработчикаПриИзмененииПосле(Элемент)
	am_РежимРазработчикаПриИзмененииПослеНаСервере();
	
	Если am_РежимРазработчика И Объект.НомерЧекаККМ <> 0 Тогда
		ОписаниеОповещенияПодготовитьДокумент = Новый ОписаниеОповещения("ПриУтвердительномОтветеПодготовитьДокумент", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещенияПодготовитьДокумент, "Подготовить документ к редактированию?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Подготовка чека");
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриУтвердительномОтветеПодготовитьДокумент(Результат, Параметры) Экспорт
	
		
		Если Результат = КодВозвратаДиалога.Да Тогда 
			Комментарий = Объект.Комментарий;
			Если ЗначениеЗаполнено(Комментарий) Тогда
				Комментарий = Комментарий + Символы.ПС;
			КонецЕсли;
			
			Комментарий = Комментарий + "Номер чека ККМ: " + Объект.НомерЧекаККМ;
			
			Объект.Комментарий = Комментарий;
			Объект.НомерЧекаККМ = 0;
			
			ПараметрыЗаписи = Новый Структура("РежимЗаписи,РежимПроведения");
			ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение;
			ПараметрыЗаписи.РежимПроведения = РежимПроведенияДокумента.Неоперативный;
			Записать(ПараметрыЗаписи);
			Закрыть();
		КонецЕсли;		

КонецПроцедуры

&НаСервере
Процедура am_ПровестиДляТехСпециалистаПосле(Команда)
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры

&НаКлиенте
Процедура am_КассаККМПриИзмененииВместо(Элемент)
	Если НЕ am_РежимРазработчика Тогда
		КассаККМПриИзменении(Элемент);
	КонецЕсли;
КонецПроцедуры
