
&После("ДобавитьСтрокуВТаблицуРеквизитов")
Процедура am_ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Использование, РеквизитНоменклатуры, РеквизитПредставление, ПараметрРасшифровки, Ширина, СлужебныйУправлениеВидимостью)
	//НоваяСтрока							= ДоступныеПоля.Добавить();
	//НоваяСтрока.Использование			= Истина;
	//НоваяСтрока.РеквизитНоменклатуры	= "am_Бренд";
	//НоваяСтрока.РеквизитПредставление	= РеквизитПредставление;
	//НоваяСтрока.ПараметрРасшифровки		= "am_Бренд";
	//НоваяСтрока.Ширина					= "100";
	//НоваяСтрока.СлужебныйУправлениеВидимостью = СлужебныйУправлениеВидимостью;
КонецПроцедуры

&После("ДоступныеПоляНоменклатуры")
Процедура am_ДоступныеПоляНоменклатуры(ДоступныеПоля)
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "am_Бренд", "Бренд", "НоменклатураСсылка", 30);
КонецПроцедуры
