
&НаКлиенте
&Перед("РассчитатьСуммуВСтрокеТабличнойЧасти")
Процедура am_РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ПараметрыРасчета)
	
	Если ПараметрыРасчета = Неопределено Тогда
		ПараметрыРасчета = Новый Структура("СброситьФлагСкидкиРассчитаны, РассчитатьМинимальнуюЦену, РасходнаяНакладная", Истина, Истина, Истина);
	Иначе	
		ПараметрыРасчета.Вставить("РассчитатьМинимальнуюЦену", Истина);
		ПараметрыРасчета.Вставить("РасходнаяНакладная", Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура am_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	Объект.УчитыватьВНУ = РегистрыСведений.am_ХранилищеНастроек.ПолучитьПроставлятьУСНРасходнаяНакладнаяВозврат();
КонецПроцедуры
