
&НаКлиенте
Процедура am_ОтборТелефонПриИзмененииВместо(Элемент)
	
	Если СтрДлина(am_ОтборТелефон) > 3 Тогда
		Контрагенты = am_МастерКлиентВызовСервера.ПолучитьКонтрагентаСпискомЗначений(am_ОтборТелефон, 99, "Телефон");
		УстановитьМеткуИОтборСписка("Ссылка", Элемент.Родитель.Имя, Контрагенты, am_ОтборТелефон);
		am_ОтборТелефон = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура am_ОтборВИНПриИзмененииВместо(Элемент)
	
	Если СтрДлина(am_ОтборВИН) > 3 Тогда
		Контрагенты = am_МастерКлиентВызовСервера.ПолучитьКонтрагентаСпискомЗначений(am_ОтборВИН, 99, "ВИН");
		УстановитьМеткуИОтборСписка("Ссылка", Элемент.Родитель.Имя, Контрагенты, am_ОтборВИН);
		am_ОтборВИН = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура am_ОтборЗнакПриИзмененииВместо(Элемент)
	
	Если СтрДлина(am_ОтборЗнак) > 2 Тогда
		Контрагенты = am_МастерКлиентВызовСервера.ПолучитьКонтрагентаСпискомЗначений(am_ОтборЗнак, 99, "ГосНомер");
		УстановитьМеткуИОтборСписка("Ссылка", Элемент.Родитель.Имя, Контрагенты, am_ОтборЗнак);
		am_ОтборЗнак = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&После("ОбработатьАктивизациюСтрокиСписка")
Процедура am_ОбработатьАктивизациюСтрокиСписка1()
	
	//[2020.10.25] OBISOFT [obisoft_доработки] melniksv begin	| описание доработки
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		Элементы.Автомобили.Видимость = Истина;
		am_СписокАвтомобилей.Параметры.УстановитьЗначениеПараметра("Контрагент", Элементы.Список.ТекущиеДанные.Ссылка);
	Иначе
		Элементы.Автомобили.Видимость = Ложь;
		am_СписокАвтомобилей.Параметры.УстановитьЗначениеПараметра("Контрагент", ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
	КонецЕсли;
	//[2020.10.25] OBISOFT [obisoft_доработки] melniksv end

КонецПроцедуры

&НаСервере
Процедура am_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	am_СписокАвтомобилей.Параметры.УстановитьЗначениеПараметра("Контрагент", Справочники.Контрагенты.ПустаяСсылка());

КонецПроцедуры
