&НаСервере
Процедура СоздатьТипКПППоУмолчанию() Экспорт
	
	Если НЕ РегистрыСведений.am_ХранилищеНастроек.ПолучитьОбменССТО() Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьНовыйЭлементСправочника("Механическая");
	СоздатьНовыйЭлементСправочника("Автоматическая");
	СоздатьНовыйЭлементСправочника("Роботизированная");
	СоздатьНовыйЭлементСправочника("Вариатор");

КонецПроцедуры

Функция СоздатьНовыйЭлементСправочника(Наименование)
	
	Результат = Справочники.am_ТипКПП.НайтиПоНаименованию(Наименование);
	
	Если Результат = Справочники.am_ТипКПП.ПустаяСсылка() Тогда
		Спр = Справочники.am_ТипКПП.СоздатьЭлемент();
		Спр.Наименование = Наименование;
		Спр.Записать();
	КонецЕсли;
	
КонецФункции