
Функция ИсточникВызова(ИмяФормыСписка, ИмяФормыВладельца = "") Экспорт

	Список = ОбъектПоПолномуИмени(ИмяФормыСписка);
	Владелец = ОбъектПоПолномуИмени(ИмяФормыВладельца);
	
	Возврат Список +
			?(ПустаяСтрока(Владелец), "", "/"+Владелец);

КонецФункции

Функция ОбъектПоПолномуИмени(ПолноеИмя)
	
	Перем КлассОМ, ИмяОМ;
	
	ЧастиИмени = СтрРазделить(ПолноеИмя, ".");
	
	Если ЧастиИмени.Количество() >= 2 Тогда
		КлассОМ = ЧастиИмени[0];
		ИмяОМ   = ЧастиИмени[1];
	КонецЕсли;
	
	Возврат ИмяОМ;	
	
КонецФункции

Процедура ПроверимЦеныНаПризнакНижеЗакупочных(ТекСтрока) Экспорт
	
	//Если НЕ РегистрыСведений.am_ХранилищеНастроек.ПолучитьКонтрольНижеЗакупаЗаказПокупателя() Тогда
	//	Возврат;
	//КонецЕсли;
	
	//Отбор = Новый Структура;
	//Отбор.Вставить("", );
	
	
	
	
	
	
	
	//Элементы.Запасы.ТекущиеДанные
	
КонецПроцедуры