
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура am_ПриОткрытииПосле(Отказ)
	
	am_РазместитьДинамическиеЭлементы();
	
КонецПроцедуры

#КонецОбласти

#Область Работа_с_динамическими_формами

&НаСервере
Процедура am_РазместитьДинамическиеЭлементы()
	
	Если НЕ ПараметрыСеанса.ТекущийПользователь.Наименование = "Обисофт" Тогда
		Возврат;
	КонецЕсли;
	
	Поле = ЭтаФорма.Элементы.Добавить("НовыйОбъектФормы_" + 1, Тип("ПолеФормы"), Элементы.ГруппаДанныеШапки);
	Поле.Вид 					= ВидПоляФормы.ПолеФлажка;
	Поле.ПутьКДанным 			= "Объект.am_ТехПоддержка";
	Поле.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Право;
	 
КонецПроцедуры

#КонецОбласти