
&НаСервере
Процедура СоздатьТипДВСПоУмолчанию() Экспорт
	
	Если НЕ РегистрыСведений.am_ХранилищеНастроек.ПолучитьОбменССТО() Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьНовыйЭлементСправочника("Бензиновый");
	СоздатьНовыйЭлементСправочника("Дизельный");
	СоздатьНовыйЭлементСправочника("Газовый");
	СоздатьНовыйЭлементСправочника("Газодизельный");
	СоздатьНовыйЭлементСправочника("Роторно-поршневый");
		
КонецПроцедуры

Функция СоздатьНовыйЭлементСправочника(Наименование)
	
	Результат = Справочники.am_ТипДВС.НайтиПоНаименованию(Наименование);
	
	Если Результат = Справочники.am_ТипДВС.ПустаяСсылка() Тогда
		Спр = Справочники.am_ТипДВС.СоздатьЭлемент();
		Спр.Наименование = Наименование;
		Спр.Записать();
	КонецЕсли;
	
КонецФункции