
&ИзменениеИКонтроль("РассчитатьСуммуВСтрокеТабличнойЧасти")
Процедура am_РассчитатьСуммуВСтрокеТабличнойЧасти(Форма, СтрокаТабличнойЧасти, ПараметрыРасчета)

	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Форма.Элементы.Запасы.ТекущиеДанные;
	КонецЕсли;
	//[2020.10.25] OBISOFT [obisoft_доработки] melniksv begin	| описание доработки
	Если ПараметрыРасчета=Неопределено Тогда
	//	ПараметрыРасчета = Новый Структура("СброситьФлагСкидкиРассчитаны",Истина);
	//КонецЕсли;
		ПараметрыРасчета = Новый Структура("СброситьФлагСкидкиРассчитаны,РассчитатьМинимальнуюЦену,ЧекККМ",Истина,Истина,Истина);
	Иначе
		ПараметрыРасчета.Вставить("ЧекККМ",Истина);
		ПараметрыРасчета.Вставить("РассчитатьМинимальнуюЦену",Истина);
	КонецЕсли;	
	//[2020.10.25] OBISOFT [obisoft_доработки] melniksv end
	
	ПараметрыРасчета.Вставить("СуммаВключаетНДС", Форма.Объект.СуммаВключаетНДС);
	УправлениеНебольшойФирмойКлиент.РассчитатьСуммыВСтрокеТЧ(СтрокаТабличнойЧасти, ПараметрыРасчета);

КонецПроцедуры
