
&НаСервере
Процедура am_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	Элементы.ЧекиККМ_СоздатьЧЕКНаВозврат.Видимость = ТекущийПользователь <> Неопределено И ТекущийПользователь.am_ТехПоддержка;
КонецПроцедуры

&НаСервере
Функция am_СоздатьЧекНаВозвратНаСервере()
	
	ЧекККМДокумент = Документы.ЧекККМ.НайтиПоНомеру("НФНФ-666666");
	Если НЕ ЗначениеЗаполнено(ЧекККМДокумент) Тогда
		ЧекККМДокумент = Документы.ЧекККМ.СоздатьДокумент();
		ЧекККМДокумент.Номер = "НФНФ-666666";
		ЧекККМДокумент.Дата = Дата("30.12.2020 00:00:00");
		ЧекККМДокумент.КассаККМ = КассаККМ;
		ЧекККМДокумент.Статус = Перечисления.СтатусыЧековККМ.Пробит;
		ЧекККМДокумент.НомерЧекаККМ = "666666";
		
		ЧекККМДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	КонецЕсли;
	
	
	
	
	Возврат ЧекККМДокумент.Ссылка;
КонецФункции

&НаКлиенте
Процедура am_СоздатьЧекНаВозвратПосле(Команда)
	
	ЧекККМСсылка = am_СоздатьЧекНаВозвратНаСервере();
	
	//ДокументНаВозврат = Документы.ЧекККМВозврат.СоздатьДокумент();
	//ДокументНаВозврат.ЗаполнитьПоЧекуККМ(ЧекККМДокумент.Ссылка);
	
	П = Новый Структура;
	П.Вставить("Основание", ЧекККМСсылка);
	
	ОткрытьФорму("Документ.ЧекККМВозврат.Форма.ФормаДокумента", П);
	
КонецПроцедуры
