
&Вместо("ЦенаВВалюту")
Функция am_ЦенаВВалюту(Цена, ПредыдущаяВалюта, ВалютаПересчета, НаДату, СуммаВключаетНДС, СтруктураОкругления)
	СтруктураКурсы = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(ПредыдущаяВалюта, ВалютаПересчета, НаДату);

	ЦенаВВалюте = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(Цена, 
		СтруктураКурсы.КурсНач, 
		СтруктураКурсы.Курс, 
		СтруктураКурсы.КратностьНач, 
		СтруктураКурсы.Кратность);
		
		Если НЕ СтруктураОкругления.Свойство("ПравилоОкругления") Тогда
			СтруктураОкругления.Вставить("ПравилоОкругления", Неопределено);	
		КонецЕсли;

	ЦенаВВалюте = ОкруглитьЦену(ЦенаВВалюте, СтруктураОкругления.ПравилоОкругления, СтруктураОкругления.ОкруглятьВБольшуюСторону);
	Возврат ЦенаВВалюте;
КонецФункции
