
&НаСервере
Процедура am_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	Если РегистрыСведений.am_ХранилищеНастроек.ПолучитьДоступностьОстаткиИРезервыЧекККМ() Тогда
		Элементы.ОстаткиИРезервы.Доступность = Истина;
	КонецЕсли;
	
	Если РегистрыСведений.am_ХранилищеНастроек.ПолучитьРазмещениеАвтоВЧККМ() Тогда
		Поле = ЭтаФорма.Элементы.Добавить("НовыйОбъектФормы_" + 1, Тип("ПолеФормы"), Элементы.ЛеваяКолонка);
		Поле.Вид 					= ВидПоляФормы.ПолеВвода;
		Поле.ПутьКДанным 			= "Объект.am_Автомобиль";
	КонецЕсли;
	
	Если РегистрыСведений.am_ХранилищеНастроек.ПолучитьИсточникОбращения() Тогда
		Поле = ЭтаФорма.Элементы.Добавить("НовыйОбъектФормы_" + 2, Тип("ПолеФормы"), Элементы.ЛеваяКолонка);
		Поле.Вид 					= ВидПоляФормы.ПолеВвода;
		Поле.ПутьКДанным 			= "Объект.am_ИсточникПривлечения";
	КонецЕсли;
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Если ТекПользователь <> Неопределено И ТекПользователь.am_ТехПоддержка Тогда
		ОтменитьРежимТолькоПросмотр();
		Элементы.am_СтраницаТехПоддержка.Доступность = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура am_ЗарезервироватьВместоНаСервере()
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	УстановитьДоступностьПечатиЧека();
КонецПроцедуры

&НаКлиенте
Процедура am_ЗарезервироватьВместо(Команда)
	Если am_РежимРазработчика Тогда
		am_ЗарезервироватьВместоНаСервере();
	Иначе
		Зарезервировать(Команда);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура am_РежимРазработчикаПриИзмененииПослеНаСервере()
	Элементы.НомерЧекаККМ.ТолькоПросмотр = НЕ am_РежимРазработчика;
	Элементы.ОРП.ТолькоПросмотр = НЕ am_РежимРазработчика;
	Элементы.ОРП.КнопкаВыбора = am_РежимРазработчика;
	
	Элементы.СтруктурнаяЕдиница.Доступность = am_РежимРазработчика;
	Элементы.СтруктурнаяЕдиница.ТолькоПросмотр = НЕ am_РежимРазработчика;
	
	Элементы.БезналичнаяОплата.Доступность = am_РежимРазработчика;
	Элементы.СтраницаБезналичнаяОплата.Видимость = Истина;
	Элементы.ПолученоНаличными.Доступность = am_РежимРазработчика;
	Элементы.ГруппаДобавленияОплаты.Доступность = am_РежимРазработчика;
	Элементы.РасчитатьСуммуНаличнойОплаты.Доступность = am_РежимРазработчика;

КонецПроцедуры

&НаКлиенте
Процедура am_РежимРазработчикаПриИзмененииПосле(Элемент)
	am_РежимРазработчикаПриИзмененииПослеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура am_КассаККМПриИзмененииВместо(Элемент)
	Если НЕ am_РежимРазработчика Тогда
		КассаККМПриИзменении(Элемент);
	КонецЕсли;
	
	Если ПолучитьСверятьСкладСКассойККМВЧеке() Тогда
		
		Для каждого ЭлементЗапас Из Объект.Запасы Цикл
			Если ПолучитьСкладКассыККМ() <> ПолучитьСкладИзНоменклатуры(ЭлементЗапас.Номенклатура) Тогда
				ОписаниеОповещенияНеСовпадаютСкладыПриИзмененииКассы = Новый ОписаниеОповещения("НеСовпадаютСкладыПриИзмененииКассы", ЭтаФорма);
				ПоказатьВопрос(ОписаниеОповещенияНеСовпадаютСкладыПриИзмененииКассы, "Очистить таличную часть?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Не совпадают склады с кассой ККМ");						
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура am_ЗапасыНоменклатураПриИзмененииПосле(Элемент)
	Если ПолучитьСверятьСкладСКассойККМВЧеке() Тогда
		ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;		
		КонецЕсли;
		
		ТекущаяНоменклатура = ТекущиеДанные.Номенклатура;
		Если ТекущаяНоменклатура = Неопределено Тогда
			Возврат;		
		КонецЕсли;
		Если ПолучитьСкладКассыККМ() <> ПолучитьСкладИзНоменклатуры(ТекущаяНоменклатура) Тогда
			ОписаниеОповещенияНеСовпадаютСкладыПриИзмененииНоменклатуры = Новый ОписаниеОповещения("НеСовпадаютСкладыПриИзмененииНоменклатуры", ЭтаФорма);
			ПоказатьВопрос(ОписаниеОповещенияНеСовпадаютСкладыПриИзмененииНоменклатуры, "Очистить позицию?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Склад не совпадает со складом в кассе ККМ");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НеСовпадаютСкладыПриИзмененииКассы(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Объект.КассаККМ = ПредопределенноеЗначение("Справочник.КассыККМ.ПустаяСсылка");
		Возврат;
	КонецЕсли;
	
	ЗапасыНаУдаление = Новый Массив;
	Для Каждого ЭлементЗапас Из Объект.Запасы Цикл
		Если ПолучитьСкладКассыККМ() <> ПолучитьСкладИзНоменклатуры(ЭлементЗапас.Номенклатура) Тогда
			ЗапасыНаУдаление.Добавить(ЭлементЗапас);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Запас Из ЗапасыНаУдаление Цикл
		Объект.Запасы.Удалить(Объект.Запасы.Индекс(Запас));	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура НеСовпадаютСкладыПриИзмененииНоменклатуры(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Объект.КассаККМ = ПредопределенноеЗначение("Справочник.КассыККМ.ПустаяСсылка");	
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	Объект.Запасы.Удалить(Объект.Запасы.Индекс(ТекущиеДанные));	
КонецПроцедуры

&НаСервере
Функция ПолучитьСкладКассыККМ()
	Возврат Объект.КассаККМ.СтруктурнаяЕдиница;	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСкладИзНоменклатуры(Номенклатура)
	Возврат Номенклатура.Склад;	
КонецФункции

&НаСервере
Функция ПолучитьСверятьСкладСКассойККМВЧеке()
	Возврат Константы.am_СверятьСкладСКассойККМВЧеке.Получить();	
КонецФункции

&НаКлиенте
Процедура am_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	Если НЕ ПолучитьСверятьСкладСКассойККМВЧеке() Тогда
		Возврат;		
	КонецЕсли;
	Если ИмяСобытия = "ПодборПроизведен" 
		И ЗначениеЗаполнено(Параметр) 
		// Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
		
		АдресЗапасовВХранилище = Параметр;
		СписокНоменклатуры = am_ОбработкаОповещенияПослеНаСервере(АдресЗапасовВХранилище);
		Для каждого ЭлементНоменклатура Из СписокНоменклатуры Цикл
			Если ЭлементНоменклатура = Неопределено Тогда
				Возврат;				
			КонецЕсли;
			Если ПолучитьСкладКассыККМ() <> ПолучитьСкладИзНоменклатуры(ЭлементНоменклатура) Тогда
				ОписаниеОповещенияНеСовпадаютСкладыПриИзмененииКассы = Новый ОписаниеОповещения("НеСовпадаютСкладыПриИзмененииКассы", ЭтаФорма);
				ПоказатьВопрос(ОписаниеОповещенияНеСовпадаютСкладыПриИзмененииКассы, "Очистить таличную часть?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Не совпадают склады с кассой ККМ");						
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция am_ОбработкаОповещенияПослеНаСервере(АдресЗапасовВХранилище)
	Запасы = ПолучитьИзВременногоХранилища(АдресЗапасовВХранилище);
	СписокНоменклатуры = Новый Массив;
	Для Каждого ЭлементЗапас Из Запасы Цикл
		СписокНоменклатуры.Добавить(ЭлементЗапас.Номенклатура);		
	КонецЦикла;
	
	Возврат СписокНоменклатуры;
КонецФункции
