
&После("ОбработкаПроведения")
Процедура амо_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ РегистрыСведений.am_ХранилищеНастроек.ПолучитьСохранятьЦенуПокупкиПриПроведении()
		ИЛИ НЕ ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ПриходнаяНакладная.амо_ЗарегистрироватьУчетныеЦены(Ссылка, Отказ);
		
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура амо_ОбработкаУдаленияПроведения(Отказ)
	
	Если НЕ РегистрыСведений.am_ХранилищеНастроек.ПолучитьСохранятьЦенуПокупкиПриПроведении() Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ПриходнаяНакладная.амо_УдалитьУчетныеЦены(Ссылка);
	
КонецПроцедуры
