
&НаКлиенте
Процедура ОповещениеЗаполнитьШаблонЦенникаПоУмолчанию1(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПоместитьВТабличныйДокументШаблонПоУмолчанию("ШаблонЦенникаПоУмолчанию1");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеЗаполнитьШаблонЦенникаПоУмолчанию2(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПоместитьВТабличныйДокументШаблонПоУмолчанию("ШаблонЦенникаПоУмолчанию2");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеЗаполнитьШаблонЦенникаПоУмолчанию3(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПоместитьВТабличныйДокументШаблонПоУмолчанию("ШаблонЦенникаПоУмолчанию3");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеЗаполнитьШаблонЦенникаПоУмолчанию4(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПоместитьВТабличныйДокументШаблонПоУмолчанию("ШаблонЦенникаПоУмолчанию4");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЦенников_ЦенникПоУмолчанию1Вместо(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеЗаполнитьШаблонЦенникаПоУмолчанию1", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Редактируемый шаблон будет заменен на шаблон по умолчанию, продолжить?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЦенников_ЦенникПоУмолчанию2Вместо(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеЗаполнитьШаблонЦенникаПоУмолчанию2", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Редактируемый шаблон будет заменен на шаблон по умолчанию, продолжить?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЦенников_ЦенникПоУмолчанию3Вместо(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеЗаполнитьШаблонЦенникаПоУмолчанию3", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Редактируемый шаблон будет заменен на шаблон по умолчанию, продолжить?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЦенников_ЦенникПоУмолчанию4Вместо(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеЗаполнитьШаблонЦенникаПоУмолчанию4", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Редактируемый шаблон будет заменен на шаблон по умолчанию, продолжить?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры
