
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ГруппаНаценки.Видимость =  РегистрыСведений.am_ХранилищеНастроек.ПолучитьРазрешитьПроцентНаценкиВБрендах();
	//Элементы.ПроцентНаценки.Видимость = РегистрыСведений.am_ХранилищеНастроек.ПолучитьРазрешитьПроцентНаценкиВБрендах();
	Если Элементы.ГруппаНаценки.Видимость Тогда
		ФиктивнаяНаценка = Объект.Диапазон.Итог("Процент");
		ВидимостьДиапазона = Объект.Диапазон.Количество() > 1;
		Элементы.ФиктивнаяНаценка.Видимость = НЕ ВидимостьДиапазона;
		Элементы.ГруппаДиапазон.Видимость = ВидимостьДиапазона;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьДиапазонаПриИзменении(Элемент)
	Элементы.ФиктивнаяНаценка.Видимость = НЕ ВидимостьДиапазона;
	Элементы.ГруппаДиапазон.Видимость = ВидимостьДиапазона;
КонецПроцедуры

&НаСервере
Процедура ФиктивнаяНаценкаПриИзмененииНаСервере()
	Если Объект.Диапазон.Количество() = 0 Тогда
		НоваяСтрока = Объект.Диапазон.Добавить();
		НоваяСтрока.От = 0;
		НоваяСтрока.До = 999999;
	КонецЕсли;
	Объект.Диапазон[0].Процент = ФиктивнаяНаценка;
КонецПроцедуры

&НаКлиенте
Процедура ФиктивнаяНаценкаПриИзменении(Элемент)
	ФиктивнаяНаценкаПриИзмененииНаСервере();
КонецПроцедуры
