

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура am_СписокПриАктивизацииСтрокиПосле(Элемент)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		Элементы.СписокАртикулов.Видимость = Истина;
		
		После_ОбработатьАктивизациюСтрокиСпискаНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	Иначе
		Элементы.Артикула.Видимость = Ложь;
		am_СписокАртикулов.Очистить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура После_ОбработатьАктивизациюСтрокиСпискаНаСервере(Заказ)
	
	am_СписокАртикулов.Очистить();
	
	Для Каждого Строка Из Заказ.Запасы Цикл
		ТекСтрока = am_СписокАртикулов.Добавить();
		ТекСтрока.Наименование 	 = Строка.Номенклатура.Артикул;
		ТекСтрока.Поставщик		 = НайдёмВЗаказах(Строка.Номенклатура, Заказ.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НайдёмВЗаказах(Номенклатура, Док)
	
	Текст = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказПоставщикуЗапасы.Ссылка.Контрагент КАК Контрагент,
	|	ЗаказПоставщикуЗапасы.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы
	|ГДЕ
	|	ЗаказПоставщикуЗапасы.Ссылка.Проведен
	|	И ЗаказПоставщикуЗапасы.Номенклатура = &Номенклатура
	|	И ЗаказПоставщикуЗапасы.Ссылка.ЗаказПокупателя = &Ссылка";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Ссылка", Док);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Текст = "" + Текст + Выборка.Контрагент + ?(Выборка.Количество() = 1, "", ", ");
	КонецЦикла;
	
	Возврат Текст
	
КонецФункции

#КонецОбласти





