
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Автомобили.Параметры.УстановитьЗначениеПараметра("Контрагент",Справочники.Контрагенты.ПустаяСсылка());
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПриАктивизацииСтроки(Элемент)
	Если Элементы.Контрагенты.ТекущиеДанные <> Неопределено Тогда
		ОтборАвтомобилей(Элементы.Контрагенты.ТекущиеДанные.Контрагент);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтборАвтомобилей(ВыделенныйКонтрагент)
	Автомобили.Параметры.УстановитьЗначениеПараметра("Контрагент",ВыделенныйКонтрагент);
КонецПРоцедуры

&НаСервере
Процедура ПодстрокаТелефонаПриИзмененииНаСервере()
	Если СокрЛП(ПодстрокаТелефона) = "" Тогда
		Контрагенты.Очистить();
		Возврат;
	КонецЕсли;
	КонтрагентыССервера = am_МастерКлиентВызовСервера.ПолучитьКонтрагента(ПодстрокаТелефона);
	Если КонтрагентыССервера <> Неопределено Тогда
		Контрагенты.Загрузить(КонтрагентыССервера);
	Иначе
		Контрагенты.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодстрокаТелефонаПриИзменении(Элемент)
	ПодстрокаТелефонаПриИзмененииНаСервере();
КонецПроцедуры
