
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	//ОтчетыУНФ.ПриКомпоновкеРезультата(КомпоновщикНастроек, СхемаКомпоновкиДанных, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	//
	//УстановитьПериодПоУмолчанию();
КонецПроцедуры

Процедура УстановитьПериодПоУмолчанию()
	
	СтПериод = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтПериод");
	УстановитьДатуНачала(СтПериод);
	УстановитьДатуОкончания(СтПериод);
	
КонецПроцедуры

Процедура УстановитьДатуНачала(СтПериод)
	
	Если ЗначениеЗаполнено(СтПериод.Значение.ДатаНачала) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Управленческий.Период КАК Период
	|ИЗ
	|	РегистрБухгалтерии.Управленческий КАК Управленческий
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	СтПериод.Значение.ДатаНачала = Выборка.Период;
	
КонецПроцедуры

Процедура УстановитьДатуОкончания(СтПериод);

	Если ЗначениеЗаполнено(СтПериод.Значение.ДатаОкончания) Тогда
		Возврат;
	КонецЕсли;
	
	СтПериод.Значение.ДатаОкончания = КонецДня(ТекущаяДатаСеанса());
	
КонецПроцедуры

ЭтоОтчетУНФ = Истина;
