
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("ДатаОкончания") Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ЗаполнитьНоменклатуру(Параметры.ДатаОкончания, Параметры.Назначение, Параметры.Организация);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНоменклатуру(КонецПериода, Счет, Организация)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ЗапасыОстаткиИОбороты.Номенклатура КАК Номенклатура,
	               |	СУММА(ЗапасыОстаткиИОбороты.СуммаОборот) КАК Сумма,
	               |	СУММА(ЗапасыОстаткиИОбороты.КоличествоОборот) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.Запасы.ОстаткиИОбороты(
	               |			,
	               |			КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	               |			Регистратор,
	               |			,
	               |			СчетУчета.Наименование = &Счет
	               |				И Организация = &Организация) КАК ЗапасыОстаткиИОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗапасыОстаткиИОбороты.Организация,
	               |	ЗапасыОстаткиИОбороты.Номенклатура
	               |
	               |ИМЕЮЩИЕ
	               |	(СУММА(ЗапасыОстаткиИОбороты.СуммаОборот) <> 0
	               |		ИЛИ СУММА(ЗапасыОстаткиИОбороты.КоличествоОборот) <> 0)";
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Организация = &Организация", ""); 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);	
	Запрос.УстановитьПараметр("Счет", Счет);	
	Если ЗначениеЗаполнено(Организация) ТОгда
		Запрос.УстановитьПараметр("Организация", Организация);	
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество <= 0 и Выборка.Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаРасшифровки = Расшифровка.Добавить();
		
		СтрокаРасшифровки.Номенклатура = Выборка.Номенклатура;
		СтрокаРасшифровки.Сумма = Выборка.Сумма;
		СтрокаРасшифровки.Количество = Выборка.Количество;
		Если ВЫборка.Количество = 0 ТОгда
			СтрокаРасшифровки.Себестоимость = 0;
		Иначе
			СтрокаРасшифровки.Себестоимость = Выборка.Сумма / Выборка.Количество;
		КонецЕсли;
		
		ИтогоКоличество = ИтогоКоличество + Выборка.Количество;
		ИтогоСумма = ИтогоСумма  + Выборка.Сумма;
		ИтогоСебестоимость = ИтогоСебестоимость  + СтрокаРасшифровки.Себестоимость;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.Расшифровка.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекущиеДанные.Номенклатура);			
	КонецЕсли;
КонецПроцедуры
