
Процедура АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) Экспорт	
	СтандартнаяОбработка = Ложь;
	
	Если СтрДлина(Текст) > 3 Тогда
		ПоискПоНомеру = Истина;
		
		Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Текст) Тогда
			ПоискПоНомеру = Ложь;
		КонецЕсли;
		
		Если ПоискПоНомеру Тогда
			ДанныеВыбора = am_МастерКлиентВызовСервера.ПолучитьКонтрагентаСпискомЗначений(Текст, 5, "Телефон");
		Иначе
			ДанныеВыбора = am_МастерКлиентВызовСервера.ПолучитьКонтрагентаСпискомЗначений(Текст, 5, "ВИН");
		КонецЕсли;
		
		СписокСообщений = am_МастерКлиентВызовСервера._ПолучитьСообщенияПользователю(Истина);
		
		Для каждого Сообщение из СписокСообщений Цикл
			ПоказатьОповещениеПользователя(Сообщение.Текст);
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
