
&НаСервере
&Вместо("ПолучитьДанныеКонтрагентПриИзменении")
Функция am_ПолучитьДанныеКонтрагентПриИзменении(Дата, ВалютаДокумента, Контрагент, Организация)
	СтруктураДанные = Новый Структура();
	ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.am_ДоговорПоУмолчанию(Контрагент, Организация);
	СтруктураДанные.Вставить("Договор", ДоговорПоУмолчанию);
	
	СтруктураДанные.Вставить("ВалютаРасчетов", ДоговорПоУмолчанию.ВалютаРасчетов);
	
	ПрочитатьРеквизитыКонтрагента(ЭтотОбъект.РеквизитыКонтрагента, Контрагент);
	
	Возврат СтруктураДанные;
КонецФункции
