
&НаСервере
Процедура am_am_ОтображатьВРМКПриИзмененииПослеНаСервере()
	РегистрыСведений.am_СкидкиРМК.ЗаписатьКарту(Объект.Ссылка, am_ОтображатьВРМК);
КонецПроцедуры

&НаКлиенте
Процедура am_am_ОтображатьВРМКПриИзмененииПосле(Элемент)
	am_am_ОтображатьВРМКПриИзмененииПослеНаСервере();
КонецПроцедуры


&НаСервере
Процедура am_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	am_ОтображатьВРМК = РегистрыСведений.am_СкидкиРМК.КартаОтображаетсяВРМК(Объект.Ссылка);
КонецПроцедуры

