&НаСервере
Процедура am_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	НомерКлиента = Объект.Контрагент.am_НомерКлиента;
	Если ЗначениеЗаполнено(НомерКлиента) И РегистрыСведений.am_ХранилищеНастроек.ПолучитьОтображатьНомерКлиентаУПоставщика() Тогда
		СтрокаНомерКлиента = "НомерКлиента: " + НомерКлиента + Символы.ПС;
		
		Если СтрНайти(Объект.НазначениеПлатежа, "НомерКлиента") = 0 Тогда
			Объект.НазначениеПлатежа = СтрокаНомерКлиента + Объект.НазначениеПлатежа;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
&Вместо("ПолучитьДанныеКонтрагентПриИзменении")
Функция am_ПолучитьДанныеКонтрагентПриИзменении(Знач ПолучательПлатежа, ВалютаДокумента, ВидОперации)
	Результат = ПродолжитьВызов(ПолучательПлатежа, ВалютаДокумента, ВидОперации);
	
	НомерКлиента = Объект.Контрагент.am_НомерКлиента;
	Если ЗначениеЗаполнено(НомерКлиента) И РегистрыСведений.am_ХранилищеНастроек.ПолучитьОтображатьНомерКлиентаУПоставщика() Тогда
		СтрокаНомерКлиента = "НомерКлиента: " + НомерКлиента;
		
		ПлатежноеНазначение = Результат.НазначениеПлатежа;
		ПлатежноеНазначение = СтрЗаменить(ПлатежноеНазначение, СтрокаНомерКлиента, "");  
		Результат.НазначениеПлатежа = ПлатежноеНазначение + СтрокаНомерКлиента;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
