
&После("ДобавитьКомандыПечати")
Процедура АМ_ДобавитьКомандыПечати(КомандыПечати)
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИнвентаризацияЗапасовСАртикулом";
	КомандаПечати.Представление = НСтр("ru = 'Инвентаризация запасов (с артикулом)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 5;
	
КонецПроцедуры

Процедура СформироватьИнвентаризациюЗапасовСАртикулом(ОписаниеПечатнойФормы, МассивОбъектов, ОбъектыПечати)
	Перем ПервыйДокумент, НомерСтрокиНачало;
	
	Макет				= УправлениеПечатью.МакетПечатнойФормы(ОписаниеПечатнойФормы.ПолныйПутьКМакету);
	ТабличныйДокумент	= ОписаниеПечатнойФормы.ТабличныйДокумент;
	ВалютаУчета			= Константы.ВалютаУчета.Получить();
	ВалютаНациональная	= Константы.НациональнаяВалюта.Получить();
	ДанныеПечати		= Новый Структура;
	
	Запрос				= Новый Запрос(ТекстЗапросаУниверсальный());
	Запрос.УстановитьПараметр("ВалютаУчета", 		ВалютаУчета);
	Запрос.УстановитьПараметр("ВалютаНациональная", ВалютаНациональная);
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		ПечатьДокументовУНФ.ПередНачаломФормированияДокумента(ТабличныйДокумент, ПервыйДокумент, НомерСтрокиНачало, ДанныеПечати);
		
		ДанныеПечати.Очистить();
		
		Запрос.УстановитьПараметр("ТекущийДокумент",	ТекущийДокумент);
		Запрос.УстановитьПараметр("Дата",				ТекущийДокумент.Дата);
		Запрос.УстановитьПараметр("Комиссия", 			ТекущийДокумент.Комиссия);
		
		РезультатЗапроса		= Запрос.ВыполнитьПакет();
		Шапка					= РезультатЗапроса[0].Выбрать();
		ВыборкаСтрокТовары		= РезультатЗапроса[1].Выбрать();
		ВыборкаКомиссия			= РезультатЗапроса[2].Выбрать();
		ВыборкаСерийныеНомера	= РезультатЗапроса[3].Выбрать();
		
		Шапка.Следующий();
		
		//:::Шапка
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
		ШаблонЗаголовка = Нстр("ru ='Инвентаризация запасов № %1 от %2'");
		
		ДанныеПечати.Вставить("ТекстЗаголовка", СтрШаблон(ШаблонЗаголовка, НомерДокумента, Формат(Шапка.ДатаДокумента, "ДЛФ=DD")));
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
			
		//:::Поставщик
		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		
		СведенияОбОрганизации    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
		ПредставлениеОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,");
		
		ДанныеПечати.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
		ДанныеПечати.Вставить("ПредставлениеПодразделения", Шапка.ПредставлениеПодразделения);
		ДанныеПечати.Вставить("ВалютаНаименование", Строка(ВалютаУчета));
		ДанныеПечати.Вставить("Валюта", ВалютаУчета);
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		//:::Шапка таблицы
		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
		
		ИтогСуммы        = 0;
		ИтогСуммыПоУчету = 0;
		
		//:::Табличная часть
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		
		ПараметрыНоменклатуры = Новый Структура;
		
		Пока ВыборкаСтрокТовары.Следующий() Цикл
			
			ДанныеПечати.Очистить();
			
			ДанныеПечати.Вставить("НомерСтроки", ВыборкаСтрокТовары.Номер);
			
			ПараметрыНоменклатуры.Очистить();
			ПараметрыНоменклатуры.Вставить("ПредставлениеНоменклатуры", ВыборкаСтрокТовары.ПредставлениеНоменклатуры);
			ПараметрыНоменклатуры.Вставить("ПредставлениеХарактеристики", ВыборкаСтрокТовары.Характеристика);
			ПараметрыНоменклатуры.Вставить("ПредставлениеАртикула", ВыборкаСтрокТовары.Артикул);
			ПараметрыНоменклатуры.Вставить("ПредставлениеСерийногоНомера", РаботаССерийнымиНомерами.СтрокаСерийныеНомераИзВыборки(ВыборкаСерийныеНомера, ВыборкаСтрокТовары.КлючСвязи));
			ДанныеПечати.Вставить("ПредставлениеНоменклатуры", ПечатьДокументовУНФ.ПредставлениеНоменклатуры(ПараметрыНоменклатуры));
			
			ДанныеПечати.Вставить("Отклонение", ВыборкаСтрокТовары.Отклонение);
			ДанныеПечати.Вставить("Количество", ВыборкаСтрокТовары.ФактКоличество);
			ДанныеПечати.Вставить("КоличествоПоУчету", ВыборкаСтрокТовары.БухКоличество);
			ДанныеПечати.Вставить("ЕдиницаИзмеренияНаименование", ВыборкаСтрокТовары.ЕдиницаИзмеренияНаименование);
			ДанныеПечати.Вставить("Цена", ВыборкаСтрокТовары.ЦенаБезПересчета);
			ДанныеПечати.Вставить("Сумма", ВыборкаСтрокТовары.СуммаБезПересчета);
			ДанныеПечати.Вставить("СуммаПоУчету", ВыборкаСтрокТовары.СуммаПоУчету);
			//+АняновМА
			ДанныеПечати.Вставить("ПредставлениеАртикула", ВыборкаСтрокТовары.Артикул);
			//-АняновМА
			
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ИтогСуммы        = ИтогСуммы        + ВыборкаСтрокТовары.СуммаБезПересчета;
			ИтогСуммыПоУчету = ИтогСуммыПоУчету + ВыборкаСтрокТовары.СуммаПоУчету;
			
		КонецЦикла;
		
		// Вывести Итого
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		
		ДанныеПечати.Очистить();
		ДанныеПечати.Вставить("Всего", УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогСуммы));
		ДанныеПечати.Вставить("ВсегоПоУчету", УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогСуммыПоУчету));
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим подписи к документу
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		
		ДанныеПечати.Очистить();
		ДанныеПечати.Вставить("РасшифровкаПодписиМОЛ1", Шапка.РасшифровкаПодписиМОЛ1);
		ДанныеПечати.Вставить("РасшифровкаПодписиМОЛ2", Шапка.РасшифровкаПодписиМОЛ2);
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
КонецПроцедуры

&После("Печать")
Процедура АМ_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ИнвентаризацияЗапасовСАртикулом");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияЗапасов_ИнвентаризацияЗапасовСАртикулом";
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ИнвентаризацияЗапасов.ПФ_MXL_ИнвентаризацияЗапасовСАртикулом";
		ПечатнаяФорма.СинонимМакета = НСтр("ru ='Инвентаризация запасов'");
		
		СформироватьИнвентаризациюЗапасовСАртикулом(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати);
		
	КонецЕсли;
	
КонецПроцедуры
