
&НаКлиенте
Процедура am_ЗапасыПриИзмененииПосле(Элемент)
	ТекДанные = ЭтаФорма.Элементы.Запасы.ТекущиеДанные;
	ТекДанные.am_Цена = ПолучитьЦенуНоменклатуры(ТекДанные.Номенклатура);
	
	Если ТекДанные.am_Цена <> 0 Тогда
		ТекДанные.am_Сумма = ТекДанные.Количество * ТекДанные.am_Цена;
	Иначе
		ТекДанные.am_Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуНоменклатуры(НоменклатураСсылка)
        
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
        |   ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
        |ИЗ
        |   РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
        |ГДЕ
        |   ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
    
    Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка); 
    
    РезультатЗапроса = Запрос.Выполнить();
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Если ВыборкаДетальныеЗаписи.Следующий() Тогда
         Возврат ВыборкаДетальныеЗаписи.Цена;
    Иначе
         Возврат 0;
    КонецЕсли;
      
КонецФункции