
&НаСервере
Процедура СоздатьБрендПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Бренды.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.am_Бренды КАК Бренды";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		
		Бренд = Справочники.am_Бренды.СоздатьЭлемент();
		Бренд.Наименование = "<Без бренда>";
		Бренд.Записать();
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.ТипНоменклатуры = &ТипНоменклатуры";
	Запрос.УстановитьПараметр("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Запас);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СпрН = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ ЗначениеЗаполнено(СпрН.am_Бренд) Тогда
			СпрН.am_Бренд = Справочники.am_Бренды.НайтиПоНаименованию("<Без бренда>");
			СпрН.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры