
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура am_ПриОткрытииПосле(Отказ)
	
	am_РазместитьДинамическиеЭлементы();
	
	am_ВидимостьИПеремещениеОбъектов();
	
	Элементы.am_ОбъемРозлива.Видимость = Объект.am_ИспользоватьДляРозлива;
КонецПроцедуры

&НаКлиенте
Процедура am_ИспользоватьДляРозливаПриИзмененииПосле(Элемент)
	Элементы.am_ОбъемРозлива.Видимость = Объект.am_ИспользоватьДляРозлива;
	Если НЕ Объект.am_ИспользоватьДляРозлива Тогда
		Объект.am_ОбъемРозлива = 0;		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура am_ВидимостьИПеремещениеОбъектов()
	
	Элементы.НовыйОбъектФормы_1.РастягиватьПоГоризонтали = Ложь;
	
	Если НЕ РегистрыСведений.am_ХранилищеНастроек.ПолучитьПростаяФормаКарточкиНоменклатуры() Тогда
		Возврат;
	КонецЕсли;
	
	//Настройки для Автомолла
	//Скроем объекты формы
	
	Элементы.ПереключениеИзображений.Видимость = Ложь; 
	Элементы.ГруппаАлкогольнаяПродукция.Видимость = Ложь;
	Элементы.ГруппаМаркировка.Видимость = Ложь;
	Элементы.ГруппаМаркировкаИСМП.Видимость = Ложь;
	Элементы.ГруппаТабачнаяПродукция.Видимость = Ложь;
	Элементы.ГруппаИСМП.Видимость = Ложь;
	Элементы.ГруппаШиныИПокрышки.Видимость = Ложь;
	Элементы.ГруппаСредствоИндивидуальнойЗащиты.Видимость = Ложь;
	Элементы.ГруппаВЕТИС.Видимость = Ложь;
	Элементы.ГруппаЗакупкаПроизводство.Видимость = Ложь;
	Элементы.ГруппаХранение.Видимость = Ложь;
	Элементы.ГруппаПрайсЛист.Видимость = Ложь;
	Элементы.ГруппаУчетнаяИнформация.Видимость = Ложь;
	Элементы.Весовой.Видимость = Ложь;
	Элементы.Комментарий.Видимость = Ложь;
	Элементы.Вес.Видимость = Ложь;
	Элементы.ГруппаГабариты.Видимость = Ложь;
	Элементы.ГруппаАлкогольнаяПродукция.Видимость = Ложь;
	Элементы.ДинамикаПродаж.Видимость = Ложь;
	
	Если am_ОбщиеНастройкиПовтИсп.ПолучитьЗначениеНастройки("ВидимостьОписания",Ложь) Тогда
		Элементы.Комментарий.Видимость = Истина;
	КонецЕсли;
	
	//Переместим объекты формы
	Элементы.Переместить(Элементы.ГруппаСгруппированныеРеквизиты, Элементы.ОсновныеРеквизиты, Элементы.Наименование);
	Элементы.Переместить(Элементы.КатегорияНоменклатуры, Элементы.ОсновныеРеквизиты, Элементы.ГруппаДополнительныеРеквизиты);
	Элементы.Переместить(Элементы.ЕдиницаИзмерения, Элементы.ГруппаРаботаСНоменклатурой);
		
	
КонецПроцедуры

#КонецОбласти

#Область Работа_с_динамическими_формами

&НаСервере
Процедура am_РазместитьДинамическиеЭлементы()
	
	Поле = ЭтаФорма.Элементы.Добавить("НовыйОбъектФормы_" + 1, Тип("ПолеФормы"), Элементы.ГруппаРаботаСНоменклатурой);
	Поле.Вид 					= ВидПоляФормы.ПолеВвода;
	Поле.ПутьКДанным 			= "Объект.am_Бренд";

КонецПроцедуры

&НаКлиенте
&После("ЗаполнитьЗначенияПоУмолчанию")
Процедура am_ЗаполнитьЗначенияПоУмолчанию(НовыйЭлемент)
	
	Если Объект.СчетУчетаЗапасов = ПредопределенноеЗначение("ПланСчетов.Управленческий.СырьеИМатериалы") Тогда

		Объект.СчетУчетаЗапасов = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
		Если Не ЗначениеЗаполнено(Объект.ТипНоменклатуры)
			Или ЭтоЗапас() Или ЭтоСертификат() Тогда
			Объект.СчетУчетаЗапасов = ПредопределенноеЗначение("ПланСчетов.Управленческий.ТоварыПродукция");
		КонецЕсли;

	КонецЕсли;
	
	Если ПолучитьКонстанту("am_НеЗаполнятьСкладВНоменклатуреПоУмолчанию") Тогда
		Объект.Склад = ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ПустаяСсылка");		
	КонецЕсли;
	
	Если ПолучитьКонстанту("am_НеЗаполнятьНаправлениеДеятельностиПоУмолчанию") Тогда
		Объект.НаправлениеДеятельности = ПредопределенноеЗначение("Справочник.НаправленияДеятельности.ПустаяСсылка");		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура am_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	Если ПолучитьКонстанту("am_УдалятьСимволыИзАртикула") И (СтрНайти(Объект.Артикул, "-") <> 0 ИЛИ
		СтрНайти(Объект.Артикул, " ") <> 0 ИЛИ
		СтрНайти(Объект.Артикул, ".") <> 0 ИЛИ
		СтрНайти(Объект.Артикул, "/") <> 0) Тогда
		
		
		Артикул = Объект.Артикул;
		Артикул = СтрЗаменить(Артикул, " ", "");
		Артикул = СтрЗаменить(Артикул, "-", ""); 
		Артикул = СтрЗаменить(Артикул, ".", ""); 
		Артикул = СтрЗаменить(Артикул, "/", "");
		
		Объект.Артикул = Артикул;
		
		Если НЕ am_ПредупреждениеОбАртикулеПоказано Тогда
			am_ПредупреждениеОбАртикулеПоказано = Истина;
			Отказ = Истина;
			
			ПоказатьПредупреждение(Неопределено, "В артикуле есть недопустимые символы. Они будут удалены.", 0, "Недопустимые символы в артикуле");
		КонецЕсли;				
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьКонстанту(Наименование)
	Возврат Константы[Наименование].Получить();	
КонецФункции

#КонецОбласти
